cf/Documents/ОтменаСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтменаСборки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.СборкаЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ОтменаСборкиЗаказа</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьОтмену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьОстаткиВЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСборке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собрано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятьРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ОтменаСборки/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Заказ, Склад
	|ИЗ
	|	Документ.ОтменаСборки
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ОТМЕНА СБОРКИ ЗАКАЗА
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвижения		КАК ВидДвижения,
	|	ВЫБОР КОГДА Ячейка = &ПустаяЯчейка ТОГДА Ссылка.Склад ИНАЧЕ Ячейка КОНЕЦ КАК СкладЯчейка,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Сборщик			   	КАК Сборщик,
	|	СУММА(Собрано)		КАК Собрано
    |ИЗ
	|	Документ.ОтменаСборки.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Ячейка = &ПустаяЯчейка ТОГДА Ссылка.Склад ИНАЧЕ Ячейка КОНЕЦ,
	|	Ссылка.Заказ,
	|	Номенклатура,
	|	Сборщик
	|
	|ИМЕЮЩИЕ
	|	СУММА(Собрано) <> 0 
	|;
	
	// Товары собранные
	
	|ВЫБРАТЬ
	|	&Период						КАК Период,
	|	&ВидДвижения				КАК ВидДвижения,
	|	Ссылка.Заказ				КАК Заказ,
	|	Ссылка.Склад				КАК Склад,
	|	Ссылка.СборочныйЛист		КАК СборочныйЛист,
	|	Номенклатура	   		 	КАК Номенклатура,
	|	-Собрано					КАК Количество
    |ИЗ
	|	Документ.ОтменаСборки.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка 
	//|;
	
	
	//// СБОРКА ЗАКАЗА
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	&ВидДвижения		КАК ВидДвижения,
	//|	ВЫБОР КОГДА Ячейка = &ПустаяЯчейка ТОГДА Ссылка.Склад ИНАЧЕ Ячейка КОНЕЦ КАК СкладЯчейка,
	//|	Ссылка.Заказ		КАК Заказ,
	//|	Номенклатура	    КАК Номенклатура,
	//|	Сборщик			   	КАК Сборщик,
	//|	-СУММА(ВСборке)		КАК ВСборке,
	//|	-СУММА(Собрано)		КАК Собрано
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка 
	////| И	Ссылка.ЗакрытьОтмену
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР КОГДА Ячейка = &ПустаяЯчейка ТОГДА Ссылка.Склад ИНАЧЕ Ячейка КОНЕЦ,
	//|	Ссылка.Заказ,
	//|	Номенклатура,
	//|	Сборщик
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(Собрано) <> 0 ИЛИ СУММА(ВСборке) <> 0
	//|;
	//
	//// ТОВАРЫ В ЯЧЕЙКАХ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	&ВидДвиженияПриход	КАК ВидДвижения,
	//|	Ячейка,
	//|	Номенклатура	    КАК Номенклатура,
	//|	СУММА(Собрано) 		Количество
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Ссылка.ЗакрытьОтмену И Ссылка.ДобавлятьОстаткиВЯчейки И Ячейка <> &ПустаяЯчейка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ячейка,
	//|	Номенклатура
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(Собрано) > 0
	//|;
	//
	//// СБОРЩИКИ ЗАКАЗА
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	Ссылка.Заказ		Заказ,
	//|	Сборщик,
	//|	Номенклатура	    Номенклатура,
	//|	Упаковка	    	Упаковка,
	//|	Ссылка.Склад		Склад,
	//|	Ячейка,
	//|	-СУММА(Собрано) 	Количество
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Ссылка.ЗакрытьОтмену
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Ячейка,
	//|	Сборщик,
	//|	Номенклатура,
	//|	Упаковка
	//|
	//|ИМЕЮЩИЕ
	//|	СУММА(Собрано) > 0
	//|;
	
	//// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	&ВидДвиженияПриход	КАК ВидДвижения,
	//|	Ссылка.Заказ		КАК ЗаказПокупателя,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Ссылка.Склад		Размещение,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС,
	//|	СУММА(ВСборке + Собрано * ВЫБОР КОГДА Ссылка.ЗакрытьОтмену ТОГДА -1 ИНАЧЕ 1 КОНЕЦ)	КАК Количество,
	//|	СУММА(Сумма * ВЫБОР КОГДА Ссылка.ЗакрытьОтмену ТОГДА -1 ИНАЧЕ 1 КОНЕЦ)				КАК Сумма
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Ссылка.Заказ ССЫЛКА Документ.ЗаказПокупателя
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС,
	//|	Ссылка
	//|;

	//// ИНТЕРНЕТ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	&ВидДвиженияПриход	КАК ВидДвижения,
	//|	Ссылка.Заказ		КАК ИнтернетЗаказ,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Ссылка.Склад		Размещение,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС,
	//|	СУММА(ВСборке + Собрано * ВЫБОР КОГДА Ссылка.ЗакрытьОтмену ТОГДА -1 ИНАЧЕ 1 КОНЕЦ)	КАК Количество,
	//|	СУММА(Сумма * ВЫБОР КОГДА Ссылка.ЗакрытьОтмену ТОГДА -1 ИНАЧЕ 1 КОНЕЦ)				КАК Сумма
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Ссылка.Заказ ССЫЛКА Документ.ИнтернетЗаказПокупателя
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС,
	//|	Ссылка
	//|;
	//
	//// ВНУТРЕННИЕ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&Период					КАК Период,
	//|	&ВидДвиженияПриход		КАК ВидДвижения,
	//|	Ссылка.Заказ.Заказчик 	КАК Заказчик,
	//|	Ссылка.Заказ			КАК ВнутреннийЗаказ,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Ссылка.Склад				КАК Размещение,
	//|	СУММА(ВСборке + Собрано * ВЫБОР КОГДА Ссылка.ЗакрытьОтмену ТОГДА -1 ИНАЧЕ 1 КОНЕЦ)	КАК Количество
	//|ИЗ
	//|	Документ.ОтменаСборки.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И Ссылка.Заказ ССЫЛКА Документ.ВнутреннийЗаказ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Номенклатура,
	//|	Упаковка,
	//|	Ссылка
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Заказ", 				Ссылка.Заказ);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвижения", 		?(Ссылка.ЗакрытьОтмену, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход));
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 	КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 				КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ОтменаСборкиЗаказа", 	Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыСобранные",	 	Пакет[3].Выгрузить());
	
	ДополнительныеСвойства.Вставить("СборкаЗаказа", 		Новый ТаблицаЗначений);
	ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 	Новый ТаблицаЗначений);
	ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Новый ТаблицаЗначений);
	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Новый ТаблицаЗначений);
	
	//ДополнительныеСвойства.Вставить("СборкаЗаказа", 		Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 		Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("СборщикЗаказа", 		Пакет[5].Выгрузить());
	
	//ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[6].Выгрузить());
	//ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[7].Выгрузить());
	//ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Пакет[8].Выгрузить());
	
КонецПроцедуры
